Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltTypeEnum Enumeration
 The type of the bolt.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltTypeEnum
Public Enumeration BoltTypeEnum
Members
Member name | Value | Description
BOLT_TYPE_SITE | 0 |  The site bolt type.
BOLT_TYPE_WORKSHOP | 1 |  The workshop bolt type.
See Also
Reference
Tekla.Structures.Model Namespace